{
  "company": "Apple",
  "year": 2022,
  "report_type": "Environmental Progress Report",
  "extraction_date": "2025-10-22T16:05:13.290416Z",
  "findings_count": 31,
  "findings": [
    {
      "finding_id": "apple_2022_001",
      "text": "Goals We create products and services to enrich the lives of our customers. And we strive to do so in a way that sustains the ecosystems and resources that we all depend on. Setting ambitious goals is essential to this — to drive the innovation and collaboration that make change possible and to be transparent about and accountable for our progress. Climate Change Achieve carbon neutrality for our entire carbon footprint by 2030, and reach our emissions reduction target5 Create all products with net-zero carbon impact by 2030 Transition our entire product value chain, including manufacturing and product use, to 100 percent clean electricity by 2030 Resources Use only recycled and renewable materials in our products and packaging, and enhance material recovery Eliminate plastics in our packaging by 20256 Reduce water impacts in the manufacturing of our products, use of our services, and operation of our facilities Eliminate waste sent to landfill from our corporate facilities and our suppliers Highlight We’ve reduced the emissions across our value chain by over 45 percent since 2015. Highlight 20 percent of all materials shipped in products in 2022 came from recycled sources. Smarter Chemistry Drive comprehensive reporting of the chemicals used in our supply chain to make our products Integrate smarter chemistry innovation into the way we design and build our products Avoid exposure to chemicals that could be harmful to human health or the environment Highlight We’ve made new commitments to phase out PFAS from our products and manufacturing processes. 2023 Environmental Progress Report\b 6 Climate Change Resources Smarter Chemistry Engagement and Advocacy Appendix Introduction",
      "page": 5,
      "section": "Goals We create products and",
      "relevance_score": 9.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_002",
      "text": "Goals and progress Key Achieved Ongoing Not achieved Highlight Achieved carbon neutrality since April 2020 by implementing energy efficiency initiatives, sourcing 100 percent renewable electricity for Apple facilities, and securing carbon offsets for the remaining corporate emissions. Highlight Over 45 percent emissions reduction since 2015 across our value chain. Goal Become carbon neutral for our corporate operations. Goal Achieve carbon neutrality for our entire carbon footprint, including products, by 2030, reducing related emissions by 75 percent compared with 2015. Goal Transition our entire product value chain, including manufacturing and product use, to 100 percent clean electricity by 2030. 2010 2030 2022 2010 2030 GOAL 2022 2010 2030 GOAL 2022 Highlight As of March 2023, over 250 suppliers have committed to transitioning to 100 percent renewable electricity for their Apple production, with over 85 percent of Apple's direct spend for materials, manufacturing, and assembly of our products worldwide included in those commitments. 2023 Environmental Progress Report\b 8 Resources Smarter Chemistry Engagement and Advocacy Appendix Introduction Climate Change",
      "page": 7,
      "section": "Goals and progress Key Achieved",
      "relevance_score": 7.0,
      "theme": "Energy",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_003",
      "text": "Contents Introduction 3 Letter from Lisa Jackson 4 Report highlights 5 Our environmental strategy 6 Goals Climate Change 8 Goals and progress 9 Our approach 14 Low-carbon design 17 Energy efficiency 20 Clean electricity 26 Direct emissions abatement 27 Carbon removal Resources 32 Goals and progress 33 Our approach 34 Materials 48 Water 52 Zero waste Smarter Chemistry 57 Goals and progress 58 Our approach 59 Mapping and engagement 62 Assessment and management 64 Innovation Engagement and Advocacy 68 Our approach 68 Listening 69 Achieving change together 71 Supporting communities Appendix 76 A: Environmental data 85 B: Corporate facilities energy supplement 94 C: Supplier Clean Energy Program supplement 99 D: Assurance and review statements 108 E: Environment, Health and Safety Policy 110 F: ISO 14001 certification 112 Report notes 113 End notes Cover photo: Our goal is for all Apple products to have net-zero carbon impact by 2030. 2023 Environmental Progress Report\b 2",
      "page": 1,
      "section": "Contents Introduction 3 Letter from",
      "relevance_score": 6.5,
      "theme": "Climate",
      "framework": "ISO 14001"
    },
    {
      "finding_id": "apple_2022_004",
      "text": "Climate Change We aim to make all our products carbon neutral by 2030 2023 Environmental Progress Report\b 7 Resources Smarter Chemistry Engagement and Advocacy Appendix Introduction Climate Change",
      "page": 6,
      "section": "Climate Change We aim to",
      "relevance_score": 1.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_005",
      "text": "Emissions offset Corporate footprint Product footprint <1% Direct emissions (Scope 1) <1% Electricity† (Scope 2) 1% Business travel, commute, work from home, upstream impacts from scope 1 fuels, and third-party cloud services‡ (Scope 3) 65% Product manufacturing (Scope 3) 24% Product use (Scope 3) 9% Product transport (Scope 3) <1% End-of-life product processes (Scope 3) Emissions Offsets Emissions categories (% of gross emissions) Corporate energy efficiency: 0.09 million metric tons avoided Use of renewable electricity: 1.2 million metric tons avoided Product Use RECs: 0.2 million metric tons avoided Supplier clean energy: 17.4 million metric tons avoided Low-carbon materials*: 7.8 million metric tons avoided Supplier energy efficiency: 1.4 million metric tons avoided 2023 Environmental Progress Report\b 11 Resources Smarter Chemistry Engagement and Advocacy Appendix Introduction Climate Change",
      "page": 13,
      "section": "Emissions offset Corporate footprint Product",
      "relevance_score": 6.0,
      "theme": "Energy",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_006",
      "text": "This past year, we’ve continued our efforts to reduce Apple’s emissions. In 2022, our environmental programs avoided over 28 million metric tons of emissions across all scopes. Initiatives that we’ve been growing for years — like sourcing 100 percent renewable electricity for our facilities, transitioning suppliers to renewable energy, and using low-carbon materials in products — have yielded clear results. Thanks to this work, we’re decoupling business growth from emissions: While our revenue has grown by over 68 percent since 2015, our gross emissions have decreased by over 45 percent. Apple’s comprehensive carbon footprint 20.3 million metric tons net carbon emissions** * Low-carbon materials represents emissions savings from transitioning to recycled materials in our products, or use of low-carbon aluminum, as described on page 14. ** Net carbon emissions represents our total gross footprint minus carbon offsets applied to each category. Percentages shown for each emissions category represent the share of Apple’s gross footprint. Totals add up to more than 100 percent due to rounding. † Beginning in fiscal year 2022, we’re including transmission and distribution losses as part of scope 3 emissions, which are matched with renewable electricity. ‡ Beginning in fiscal year 2022, we’re incorporating emissions associated with employees working from home as part of Apple’s new hybrid work model, as well as emissions from third-party cloud services — the electricity from both of which is addressed using renewable energy.",
      "page": 10,
      "section": "This past year, we’ve continued",
      "relevance_score": 5.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_007",
      "text": "Our plan to become carbon neutral by 2030 centers around a 75 percent emissions reduction target compared with our 2015 footprint. We’ve already reduced our gross carbon footprint12 by over 45 percent since 2015. And we plan to address residual emissions through high- quality carbon removals. Progress toward net-zero emissions * Error bars: We’re continuously refining our methodology to improve our carbon footprint estimate. But there’s uncertainty inherent to modeling product-related carbon emissions, which we’ve illustrated through error bars in this graphic. ** Future emissions: Future emissions, including offsets and removals, are displayed as a linear trend to reach net-zero carbon emissions by 2030. Actual future emissions will likely not be linear. Historical emissions Gross emissions Avoided emissions Emissions offset/removal Emissions range from modeling uncertainty* Projected gross emissions Projected emissions offset/removal Future emissions (illustrative only)** Gross emissions Carbon offsets/removal Net emissions 29.5 29.5 – 25.2 25.2 – 38.4 38.4 – 27.5 27.5 – 25.1 25.1 – 22.6 23.2 20.6 22.5 0.7 20.3 0.3 (million metric tons CO2e per fiscal year) 22.5 0.1 2018 2024 2020 2026 2019 2025 2016 2021 2027 2029 2017 2023 2022 2028 2030 2015 Baseline year 75% reduction in gross emissions from 2015 net-zero carbon emissions by 2030 2023 Environmental Progress Report\b 12 Resources Smarter Chemistry Engagement and Advocacy Appendix Introduction Climate Change",
      "page": 14,
      "section": "Our plan to become carbon",
      "relevance_score": 4.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_008",
      "text": "Goals and progress Key Achieved Ongoing Not achieved Highlight In 2022,20 percent of the material we shipped in our products came from recycled or renewable sources.27 We’ve accelerated our work through new commitments to transition to 100 percent recycled cobalt, tin, gold, and rare earth elements in select components by 2025.28 Highlight Our product packaging contains only 4 percent plastic — down from 21 percent in 2015. Highlight Our Prineville, Reno, and Mesa data centers and 17 supplier facilities have been certified to the Alliance for Water Stewardship standard for leading water management practices. Goal Use only recycled and renewable materials in our products and packaging, and enhance material recovery. Goal Eliminate plastics in our packaging by 2025.29 Goal Reduce water impacts in the manufacturing of our products, use of our services, and our facility operations. Goal Eliminate waste sent to landfill from our corporate facilities and our suppliers. Highlight Our corporate facilities waste diversion rate increased to 71 percent, driven by progress at our data centers. 2021 2023 2022 2021 2023 2022 2021 2023 2022 2021 2025 GOAL 2022 2023 Environmental Progress Report\b 32 Climate Change Smarter Chemistry Engagement and Advocacy Appendix Introduction Resources",
      "page": 34,
      "section": "Goals and progress Key Achieved",
      "relevance_score": 8.0,
      "theme": "Operations",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_009",
      "text": "Resources It takes recycled guts to reduce our footprint 2023 Environmental Progress Report\b 31 Climate Change Smarter Chemistry Engagement and Advocacy Appendix Introduction Resources",
      "page": 33,
      "section": "Resources It takes recycled guts",
      "relevance_score": 2.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_010",
      "text": "FEATURE Our transition to certified recycled materials by product line We're using more recycled materials than ever * Material is considered “not applicable” if it’s found only in small quantities dispersed across modules. All products launched in the calendar year include certified recycled content Some products launched in the calendar year include certified recycled content No products launched in the calendar year include certified recycled content Recycled content not applicable* In 2022, the average recycled content shipped in Apple products increased to 20 percent. We’ve approached the work material by material, component by component, starting by introducing recycled content in one product and then expanding across Apple’s product lines. 2017",
      "page": 38,
      "section": "FEATURE Our transition to certified",
      "relevance_score": 1.0,
      "theme": "Materials",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_011",
      "text": "21% plastic 4% plastic 2021 257,000 4% 33% 63% Packaging fiber and plastic footprint* (metric tons) Our goal is to eliminate all plastics from our packaging by 2025.** In 2022, only 4 percent of our packaging footprint was from plastic, and 66 percent came from recycled fiber. Since 2017, 100 percent of the virgin wood fiber in our packaging has come from responsible sources.† 21% 31% 48% 2015 172,000 The Conservation Fund and World Wildlife Fund, we’ve protected and improved forest management practices on more than one million acres of working forests in the U.S. and China. In 2022, these forests generated enough responsibly sourced fiber to balance all the virgin fiber in our packaging, while contributing to the global supply of responsibly sourced fiber.54 2023 Environmental Progress Report\b 40 Climate Change Smarter Chemistry Engagement and Advocacy Appendix Introduction Resources",
      "page": 45,
      "section": "21% plastic 4% plastic 2021",
      "relevance_score": 3.5,
      "theme": "Materials",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_012",
      "text": "2019 2020 2021 2022 Copper Zinc Steel Gold Tungsten* Rare earth elements Aluminum Tin Plastic Apple Watch Desktop Notebook iPad iPhone Apple Watch Desktop Notebook iPad iPhone Apple Watch Desktop Notebook iPad iPhone Apple Watch Desktop Notebook iPad iPhone Apple Watch Desktop Notebook iPad iPhone Apple Watch Desktop Notebook iPad iPhone Products launched by calendar year 2023 Environmental Progress Report\b 36 Climate Change Smarter Chemistry Engagement and Advocacy Appendix Introduction Resources",
      "page": 40,
      "section": "2019 2020 2021 2022 Copper",
      "relevance_score": 1.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_013",
      "text": "2010 2030 2022 2010 2030 GOAL 2022 2010 2030 GOAL 2022 Key Achieved Ongoing Not achieved Goals and progress HIGHLIGHT We performed toxicological assessments on over 1300 materials in 2022 to proactively evaluate and eliminate potentially harmful substances from our products. HIGHLIGHT Apple led the IPC task group that helped develop and publish a new IPC industry standard on the use of safer cleaners in 2022. HIGHLIGHT We’ve included over 47,000 materials in our comprehensive material library. GOAL Avoid exposure to chemicals that could be harmful to human health or the environment. GOAL Integrate smarter chemistry innovation into the way that we design and build our products. GOAL Drive comprehensive reporting of chemicals used in our supply chain to make our products. 2023 Environmental Progress Report\b 57 Climate Change Resources Engagement and Advocacy Appendix Introduction Smarter Chemistry",
      "page": 62,
      "section": "2010 2030 2022 2010 2030",
      "relevance_score": 3.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_014",
      "text": "Smarter Chemistry Protecting those who make, use, and recycle our products by using safer materials 2023 Environmental Progress Report\b 56 Climate Change Resources Engagement and Advocacy Appendix Introduction Smarter Chemistry",
      "page": 61,
      "section": "Smarter Chemistry Protecting those who",
      "relevance_score": 1.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_015",
      "text": "Brominated flame retardants (BFRs) Mercury Lead Arsenic Beryllium PFAS (PFOA and PFOS) We’ve replaced these with safer thermoplastic elastomers. Both are still used by other companies in power cords and headphone cables. In 2008, we eliminated BFRs from thousands of parts, such as enclosures, cables, circuit boards, and connectors. We use safer metal hydroxides and phosphorus compounds in their place. We eliminated mercury from displays in 2009. We use energy- efficient, mercury-free LEDs and OLEDs instead of mercury-based fluorescent lamps in all our displays. Apple phased lead out of display glass and solder in 2006. Arsenic, traditionally used in glass, has been eliminated from Apple display glass since 2008. Eliminated from all new product designs, beryllium is found in copper alloys used to make connectors and springs. We eliminated PFOA and PFOS from our products, with RSS restrictions added in 2010 and 2013, respectively. These types of chemicals are commonly used in manufacturing water-resistant materials. We’re committed to eliminating PFAS entirely from our products. 2023 Environmental Progress Report\b 65 Climate Change Resources Engagement and Advocacy Appendix Introduction Smarter Chemistry",
      "page": 70,
      "section": "Brominated flame retardants (BFRs) Mercury",
      "relevance_score": 5.0,
      "theme": "Energy",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_016",
      "text": "Engagement and Advocacy We hear our stakeholders loud and clear 2023 Environmental Progress Report\b 67 Climate Change Resources Smarter Chemistry Appendix Introduction Engagement and Advocacy",
      "page": 72,
      "section": "Engagement and Advocacy We hear",
      "relevance_score": 1.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_017",
      "text": "Appendix focusing on the finer details of our progress 2023 Environmental Progress Report\b 74 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 79,
      "section": "Appendix focusing on the finer",
      "relevance_score": 1.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_018",
      "text": "Appendix contents 99 Appendix D: Assurance and review statements 100 Net comprehensive carbon footprint, facilities energy, carbon, waste, paper, and water data (Apex) 102 Product carbon footprint (Fraunhofer Institute) 104 Supplier Clean Energy Program (Apex) 105 Supplier Energy Efficiency Program (Apex) 106 Packaging fiber and plastic footprint (Fraunhofer Institute) 108 Appendix E: Environment, Health and Safety Policy 110 Appendix F: ISO 14001 certification 112 Report notes 113 End notes 76 Appendix A: Environmental data 77 Greenhouse gas emissions 78 Carbon offsets 79 Carbon footprint by product 81 Apple’s life cycle assessment methodology 82 Energy 83 Resources 84 Normalizing factors 85 Appendix B: Corporate facilities energy supplement 94 Appendix C: Supplier Clean Energy Program supplement 2023 Environmental Progress Report\b 75 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 80,
      "section": "Appendix contents 99 Appendix D:",
      "relevance_score": 5.0,
      "theme": "Climate",
      "framework": "ISO 14001"
    },
    {
      "finding_id": "apple_2022_019",
      "text": "Appendix A 77 Greenhouse gas emissions 78 Carbon offsets 79 Carbon footprint by product 81 Apple’s life cycle assessment methodology 82 Energy 83 Resources 84 Normalizing factors Environmental data 2023 Environmental Progress Report\b 76 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 81,
      "section": "Appendix A 77 Greenhouse gas",
      "relevance_score": 2.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_020",
      "text": "Appendix A Carbon footprint by product The following tables list the carbon footprints (in kilograms) of Apple products sold as of March 9, 2022, along with select configurations.* Storage configurations iPhone Unit 64GB 128GB 256GB 512GB 1TB iPhone 14 kg – 61 67 83 – iPhone 14 Plus kg – 68 75 91 – iPhone 14 Pro kg – 65 71 84 116 iPhone 14 Pro Max kg – 73 80 93 124 iPhone 13 mini kg – 61 69 81 – iPhone 13 kg – 64 71 83 – iPhone 12 kg 70 75 85 – – iPhone SE (3rd generation) kg 46 50 58 – – Storage configurations iPad Unit 64GB 128GB 256GB 512GB 1TB 2TB iPad Pro 12.9-inch (6th generation) Wi-Fi + Cellular kg – 135 142 156 183 284 iPad Pro 11-inch (4th generation) Wi-Fi + Cellular kg – 107 121 121 148 249 iPad Air (5th generation) Wi-Fi + Cellular kg 80 84 92 – – – iPad (10th generation) Wi-Fi + Cellular kg 72 82 – – – – iPad (9th generation) Wi-Fi + Cellular kg 75 – 84 – – – iPad mini (6th generation) Wi-Fi + Cellular kg 68 71 77 90 – – Select product configurations Apple Watch Unit Aluminum case with Sport Loop Aluminum case with Sport Band Stainless steel case with Sport Band Titanium case with Ocean Band Titanium case with Trail Loop Apple Watch Ultra, 49mm kg – – – 56 56 Apple Watch Series 8, 45mm kg – 33 35 – – Apple Watch SE (2nd generation), 44mm kg 28 31 – – – Notes: • Dashes indicate that the configuration does not exist. * Product carbon footprint data for Apple products are published in our Product Environmental Reports and are accurate as of product launch. In instances where carbon models were developed prior to product launch, we leverage preproduction units. 2023 Environmental Progress Report\b 79 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 84,
      "section": "Appendix A Carbon footprint by",
      "relevance_score": 2.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_021",
      "text": "Storage configurations Notebooks Unit 256GB 512GB 1TB 16-inch MacBook Pro (2023), Apple M2 Pro chip with 12-core CPU and 19-core GPU kg – 300 327 16-inch MacBook Pro (2023), Apple M2 Max chip with 12-core CPU and 38-core GPU kg – – 356 14-inch MacBook Pro (2023), Apple M2 Pro chip with 10-core CPU and 16-core GPU kg – 243 – 14-inch MacBook Pro (2023), Apple M2 Pro chip with 12-core CPU and 19-core GPU kg – – 272 14-inch MacBook Pro (2023), Apple M2 Max chip with 12-core CPU and 30-core GPU kg – – 301 13-inch MacBook Pro (2022), Apple M2 chip kg 167 182 – 13-inch MacBook Air (2022), Apple M2 chip kg 147 171 – 13-inch MacBook Air (2020), Apple M1 chip kg 161 181 – Storage configurations Desktops Unit 256GB 512GB 1TB 4TB 24-inch iMac with 4.5K Retina display, Apple M1 chip with 8-core CPU and 7-core GPU kg 481 – – – 24-inch iMac with 4.5K Retina display, Apple M1 chip with 8-core CPU and 8-core GPU kg 486 511 – – Mac mini (2023), Apple M2 chip kg 112 126 – – Mac mini (2023), Apple M2 Pro chip kg – 150 – Mac Studio (2022), Apple M1 Max with 32GB memory kg – 262 – – Mac Studio (2022), Apple M1 Ultra with 64GB memory kg – – 375 – Mac Pro (2019), 3.5GHz (8-core) processor, Radeon Pro 580X, 32GB memory kg 2,765 – – – Mac Pro (2019), 2.5GHz (28-core) processor, dual Radeon Pro Vega II Duo with Infinity Fabric Link, 1.5TB memory, Afterburner card kg – – – 6,994 Displays Unit Studio Display (2022) kg 544 Pro Display XDR with Pro Stand kg 974 HomePod Unit HomePod (2nd generation) kg 92 HomePod mini kg 42 Storage configurations Apple TV Unit 64GB 128GB Apple TV 4K, Wi-Fi kg 43 – Apple TV 4K, Wi-Fi + Ethernet kg – 46 Storage configurations iPod touch Unit 32GB 128GB 256GB iPod touch (7th generation) kg 32 38 48 2023 Environmental Progress Report\b 80 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 85,
      "section": "Storage configurations Notebooks Unit 256GB",
      "relevance_score": 1.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_022",
      "text": "Appendix A Normalizing factors * Fiscal year 2022 2021 2020 2019 2018 Net sales (in millions, US$) 394,328 365,817 274,515 260,174 265,595 Number of full-time equivalent employees 164,000 154,000 147,000 137,000 132,000 * As reported in Apple’s Form 10-K Annual Report filed with the SEC. 2023 Environmental Progress Report\b 84 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 89,
      "section": "Appendix A Normalizing factors *",
      "relevance_score": 1.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_023",
      "text": "Facilities renewable energy projects To reach 100 percent renewable electricity for Apple’s own facilities, Apple has helped create 1,549 MW of renewable energy around the world. The projects listed to the right represent Apple-created renewable energy projects that support Apple facilities’ electricity use and contribute to cleaner grids around the world. Operational projects apply a mix of clean energy technology, including wind (22.9 percent), solar (76.0 percent), microhydro (0.21 percent), and biogas fuel cells (0.9 percent). This table represents all operational renewable energy projects that Apple has helped create. Location Renewable energy technology Size (MW) Australia PV 0.5 Brazil Wind 0.5 China mainland PV 130 Colombia PV 0.2 Denmark PV 42 Denmark Wind 17 France PV <0.1 India PV 2 Israel PV 5 Japan PV 12 Mexico Wind 0.8 Philippines PV 0.1 Singapore PV 35 South Africa PV 0.2 Taiwan PV 1 Turkey PV 4 Arizona, U.S. PV 55 California, U.S. Biogas fuel cell 4 California, U.S. PV 146 Illinois, U.S. Wind 112 North Carolina, U.S. Biogas fuel cell 10 North Carolina, U.S. PV 164 Nevada, U.S. PV 320 Oregon, U.S. Microhydro 3 Oregon, U.S. PV 125 Oregon, U.S. Wind 200 Texas, U.S. PV 1 Texas, U.S. Wind 25 Virginia, U.S. PV 133.6 Total 1,549 Note: Data current as of February 2023 (operational). 2023 Environmental Progress Report\b 87 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 92,
      "section": "Facilities renewable energy projects To",
      "relevance_score": 4.5,
      "theme": "Climate",
      "framework": "GRI"
    },
    {
      "finding_id": "apple_2022_024",
      "text": "Fiscal year 2022 energy and carbon footprint (corporate facilities) The table below provides a detailed breakdown of 2021 energy use, which we used to calculate our greenhouse gas emissions. Notes: • Dash indicates unavailable data. • N/A = Gas use at colocation facilities is considered outside of Apple’s operational control. 1 Scope 2 market-based emissions from purchased electricity is zero. But, we also account for purchased steam, heating, and cooling, which resulted in 3,020 metric tons of emissions in fiscal year 2022. Location Scope 1 Scope 2 Total gas (MMBtu) Renewable biogas (MMBtu) Scope 1 emissions (metric tons CO2e) Electricity (million kWh) Renewable electricity (million kWh) Scope 2 emissions (market-based, metric tons CO2e)1 Corporate 826,063 202,978 31,030 856 856 0 Cupertino, CA 672,244 202,978 22,849 428 428 0 Elk Grove, CA 13,782 – 732 13 13 0 Austin, TX 20,948 – 1,113 64 64 0 Other U.S. 67,362 – 3,585 57 57 0 Cork, Ireland 20,151 – 1,070 16 16 0 Singapore 142 – 8 15 15 0 China 686 – 37 33 33 0 Other international 30,748 – 1,636 230 230 0 Data centers 19,109 17,961 62 2,138 2,138 0 Maiden, NC 17,961 17,961 1 432 432 0 Mesa, AZ 312 – 17 379 379 0 Newark, CA – – – 20 20 0 Prineville, OR 836 0 44 275 275 0 Reno, NV – – – 419 419 0 Viborg, Denmark N/A N/A N/A 27 27 0 Colocation facilities (U.S.) N/A N/A N/A 371 371 0 Colocation facilities (international) N/A N/A N/A 117 117 0 China N/A N/A N/A 98 98 0 Retail stores 58,720 0 3,119 205 205 0 Domestic (U.S.) 36,005 – 1,912 97 97 0 International 22,716 – 1,207 108 108 0 Total 903,892 220,939 34,211 3,199 3,199 0 2023 Environmental Progress Report\b 88 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 93,
      "section": "Fiscal year 2022 energy and",
      "relevance_score": 4.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_025",
      "text": "Appendix B Corporate facilities energy supplement 2023 Environmental Progress Report\b 85 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 90,
      "section": "Appendix B Corporate facilities energy",
      "relevance_score": 1.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_026",
      "text": "Appendix C Supplier Clean Energy Program supplement 2023 Environmental Progress Report\b 94 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 99,
      "section": "Appendix C Supplier Clean Energy",
      "relevance_score": 1.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_027",
      "text": "Supplier renewable electricity solutions The following charts include breakdowns of the contracting mechanisms and technologies that suppliers have identified to help meet their commitments. Supplier renewable energy procurement mechanisms (FY2022) Supplier renewable energy technologies (FY2022) 9% direct investments 12% other technology 66% Renewable power purchases 56% Wind 2% Onsite renewable electricity 24% Renewable energy certificates 32% Solar Apple’s suppliers are implementing clean energy solutions using a variety of contracting mechanisms — with renewable power purchases representing the majority of solutions implemented to date, at 66 percent. We work with our suppliers to select projects with the greatest potential for impact and with a clear carbon, ecological, and social benefit. “Other technology” includes clean energy sources such as some forms of biomass, geothermal, and small-scale, low-impact hydro. Note: Above total doesn’t add up to 100 percent due to rounding. 2023 Environmental Progress Report\b 96 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 101,
      "section": "Supplier renewable electricity solutions The",
      "relevance_score": 6.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_028",
      "text": "Appendix D Assurance and review statements 100 Net comprehensive carbon footprint, facilities energy, carbon, waste, paper, and water data (Apex) 102 Product carbon footprint (Fraunhofer Institute) 104 Supplier Clean Energy Program (Apex) 105 Supplier Energy Efficiency Program (Apex) 106 Packaging fiber and plastic footprint (Fraunhofer Institute) 2023 Environmental Progress Report\b 99 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 104,
      "section": "Appendix D Assurance and review",
      "relevance_score": 4.0,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_029",
      "text": "Corporate Packaging Fiber and Plastic Footprint Review 3 Based on the process and procedures conducted, there is no evidence that the corporate packaging fiber and plastic footprint is not materially correct and is not a fair representation of fiber and plastic data and information. Berlin, March 10, 2023 - Marina Proske - - Karsten Schischke - Fraunhofer IZM Fraunhofer IZM Dept. Environmental and Dept. Environmental and Reliability Engineering Reliability Engineering 2023 Environmental Progress Report\b 107 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 112,
      "section": "Corporate Packaging Fiber and Plastic",
      "relevance_score": 2.0,
      "theme": "Materials",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_030",
      "text": "Appendix E Environment, Health and Safety Policy 2023 Environmental Progress Report\b 108 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 113,
      "section": "Appendix E Environment, Health and",
      "relevance_score": 1.5,
      "theme": "Climate",
      "framework": "Internal"
    },
    {
      "finding_id": "apple_2022_031",
      "text": "Appendix F ISO 14001 certification 2023 Environmental Progress Report\b 110 Climate Change Resources Smarter Chemistry Engagement and Advocacy Introduction Appendix",
      "page": 114,
      "section": "Appendix F ISO 14001 certification",
      "relevance_score": 1.0,
      "theme": "Climate",
      "framework": "ISO 14001"
    }
  ]
}